InformationRegisters/ТокеныСинхронизацииЯндексAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТокеныСинхронизацииЯндексAPI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЖизниТокенаAPI</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СекретныйКодКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСЯндексAPIВызовСервера/Ext/Module.bsl
Функция ПолучитьПараметрыАвторизации(ЭтоАвторизация = Ложь) Экспорт
	
	ПараметрыАвторизации = Константы.ДанныеАвторизацииЯндексAPI.Получить().Получить();
	
	Если НЕ ТипЗнч(ПараметрыАвторизации) = Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Дополняем параметры данными по ресурсам
	ПараметрыАвторизации.Вставить("СерверАвторизации", 		"oauth.yandex.ru");
	ПараметрыАвторизации.Вставить("РесурсАвторизации", 		"/token");
	ПараметрыАвторизации.Вставить("Сервер", 				"cloud-api.yandex.net");
	ПараметрыАвторизации.Вставить("РесурсМетаданных", 		"/v1/disk/resources");
	ПараметрыАвторизации.Вставить("РесурсЗагрузкиФайла", 	"/v1/disk/resources/upload");
	ПараметрыАвторизации.Вставить("РесурсЗагрузкиПапки",	"/v1/disk/resources");
	ПараметрыАвторизации.Вставить("РесурсСкачиванияФайла",	"/v1/disk/resources/download");
	
	ЗаполнитьДействующиеТокены(ПараметрыАвторизации);
	
	Если НЕ ЭтоАвторизация И (ПустаяСтрока(ПараметрыАвторизации.ТокенОбновления) ИЛИ ПустаяСтрока(ПараметрыАвторизации.ТокенДоступа)) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыАвторизации;
	
КонецФункции

Функция СохранитьФайлНаДиск(ИмяСобытия, СтруктураФайла, ПараметрыПользователя, ПутьКПапке) Экспорт 
	
	Возврат СохранитьФайлНаЯндексДиск(ИмяСобытия, СтруктураФайла, ПараметрыПользователя, ПутьКПапке);
	
КонецФункции

Функция СоздатьПапкуНаДиске(ИмяСобытия, ИмяПапки, ПараметрыПользователя, МассивПапок) Экспорт 
	
	Возврат СохранитьФайлНаЯндексДиск(ИмяСобытия, ИмяПапки, ПараметрыПользователя,, МассивПапок);
	
КонецФункции

Функция СохранитьФайлНаЯндексДиск(ИмяСобытия, СтруктураФайла, ПараметрыПользователя, ПутьКПапке = "", МассивПапок = Неопределено) Экспорт
	
	СтруктураПараметров = ПодготовкаСоединенияПоAPI(ПараметрыПользователя, "Сервер");
	Если СтруктураПараметров = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	ЭтоПапка = (ТипЗнч(СтруктураФайла) = Тип("Строка"));
	
	Если ЭтоПапка Тогда
		ИмяФайла = ПараметрыПользователя.ПутьАрхивации + "/" + СтруктураФайла;
	Иначе
		ИмяФайла = ПараметрыПользователя.ПутьАрхивации + "/" + ПутьКПапке + "/" + СтруктураФайла.ИмяФайла + "." + СтруктураФайла.Расширение;
	КонецЕсли;

	СтруктураПараметров.Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8");
	
	// Формируем запрос на получение URL для загрузки файла (либо создания папки)
	АдресЗапроса = СтрШаблон("%1?path=%2%3"
		, ?(ЭтоПапка, СтруктураПараметров.РесурсЗагрузкиПапки, СтруктураПараметров.РесурсЗагрузкиФайла)
		, КодироватьСтроку(ИмяФайла, СпособКодированияСтроки.КодировкаURL, "UTF-8")
		, ?(ЭтоПапка, "", "&overwrite=true")
	);
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса, СтруктураПараметров.Заголовки);
	
	Ответ = СтруктураПараметров.Соединение.ВызватьHTTPМетод(?(ЭтоПапка, "PUT", "GET"), ЗапросHTTP);
	
	Если Не Ответ.КодСостояния = 200 И Не Ответ.КодСостояния = 201 Тогда
		ТекстОшибки = СтрШаблон("Ошибка HTTP запроса %1, код ошибки %2", Ответ.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросHTTP = Неопределено;
	
	// Если это папка и мы сюда дошли, значить она создалась
	// Нужно в массив папок добавить новую папку
	Если ЭтоПапка Тогда
		
		НоваяПапка = новый Структура("type, name", "dir", ИмяФайла);
		МассивПапок.Добавить(НоваяПапка);
		
		Возврат Истина;
		
	КонецЕсли;
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());

	Фабрика = ПрочитатьJSON(Чтение);
	
	Чтение.Закрыть();
	
	Если НЕ Фабрика.Свойство("href") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СоставнойURL = новый Структура("href", Фабрика.href);
	
	Если НЕ РазобратьURL(ИмяСобытия, СоставнойURL) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Теперь формируем запрос на выгрузку файла на диск
	SSL = ?(СоставнойURL.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено);
	Соединение = новый HTTPСоединение(СоставнойURL.Сервер, СоставнойURL.Порт,,,,, SSL);
	ДвоичныеДанныеФайла = СоздатьСообщение_Файл(СтруктураФайла.Данные.Получить());
	
	ЗапросHTTP = Новый HTTPЗапрос(СоставнойURL.АдресСкрипта, СтруктураПараметров.Заголовки); 
	ЗапросHTTP.УстановитьТелоИзДвоичныхДанных(ДвоичныеДанныеФайла);
	
	Ответ = Соединение.ВызватьHTTPМетод("PUT", ЗапросHTTP);
	
	Если Не Ответ.КодСостояния = 200 И Не Ответ.КодСостояния = 201 Тогда
		ТекстОшибки = СтрШаблон("Ошибка HTTP запроса %1, код ошибки %2", Ответ.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция РазобратьURL(ИмяСобытия, НастройкиПодключения)
	
	АдресСайта = СокрЛП(НастройкиПодключения.href);

	Сервер = ""; 
	Порт = 0;
	АдресСкрипта = "";
	ЗащищенноеСоединение = Ложь;
	
	Если НЕ ПустаяСтрока(АдресСайта) Тогда
		
		АдресСайта = СтрЗаменить(АдресСайта, "\", "/");
		АдресСайта = СтрЗаменить(АдресСайта, " ", "");
		
		Если НРег(Лев(АдресСайта, 7)) = "http://" Тогда
			АдресСайта = Сред(АдресСайта, 8);
		ИначеЕсли НРег(Лев(АдресСайта, 8)) = "https://" Тогда
			АдресСайта = Сред(АдресСайта, 9);
			ЗащищенноеСоединение = Истина;
		КонецЕсли;
		
		ПозицияСлэша = СтрНайти(АдресСайта, "/");
		
		Если ПозицияСлэша > 0 Тогда
			Сервер = Лев(АдресСайта, ПозицияСлэша - 1);
			АдресСкрипта = Прав(АдресСайта, СтрДлина(АдресСайта) - ПозицияСлэша);
		Иначе	
			Сервер = АдресСайта;
			АдресСкрипта = "";
		КонецЕсли;
		
		ПозицияДвоеточия = СтрНайти(Сервер, ":");
		ПортСтрока = "0";
		Если ПозицияДвоеточия > 0 Тогда
			СерверСПортом = Сервер;
			Сервер = Лев(СерверСПортом, ПозицияДвоеточия - 1);
			ПортСтрока = Прав(СерверСПортом, СтрДлина(СерверСПортом) - ПозицияДвоеточия);
		КонецЕсли;
		
		Попытка
			
			Порт = Число(ПортСтрока);
			
		Исключение
			
			ТекстОшибки = СтрШаблон("Не удалось получить номер порта: %1 в URL для выгрузки файла на Яндекс.Диск.", ПортСтрока);
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
			Возврат Ложь;
			
		КонецПопытки;
		
		Если Порт = 0 Тогда
			Порт = ?(ЗащищенноеСоединение, 443, 80);
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкиПодключения.Вставить("Сервер", Сервер); 
	НастройкиПодключения.Вставить("Порт", Порт);
	НастройкиПодключения.Вставить("АдресСкрипта", АдресСкрипта);
	НастройкиПодключения.Вставить("ЗащищенноеСоединение", ЗащищенноеСоединение);
	
	Возврат Истина;
	
КонецФункции

Функция ПодготовкаСоединенияПоAPI(ПараметрыПользователя, ИмяСервера = "") Экспорт 
	
	СтруктураПараметров = ПолучитьПараметрыАвторизации();
	
	Если СтруктураПараметров = Неопределено Тогда 
		
		ЗаписьЖурналаРегистрации("Интеграция с Яндекс.Диск. Авторизация", УровеньЖурналаРегистрации.Ошибка,,, ТекстОбОшибкеСПараметрами());
		Возврат СтруктураПараметров;
		
	КонецЕсли;
	
	Если ТекущаяДатаСеанса() > ПараметрыПользователя.ВремяЖизниТокенаAPI Тогда 
		//обновляем токен
		ОбновитьТокены(ПараметрыПользователя, СтруктураПараметров);
	КонецЕсли;
	
	// формируем запрос к Я.Д
	Соединение = Новый HTTPСоединение(СтруктураПараметров[ИмяСервера],,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Authorization", "OAuth " + ПараметрыПользователя.ТокенДоступа);
	
	СтруктураПараметров.Вставить("Заголовки", Заголовки);
	СтруктураПараметров.Вставить("Соединение", Соединение);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ТекстОбОшибкеСПараметрами()
	Возврат "Не загружены параметры для работы с Яндекс.Диск. Необходимо их заполнить в настройках программы ""Параметры подключения к Яндекс API"".";
КонецФункции	

Функция СоздатьСообщение_Файл(мДвоичныеДанные) Экспорт 
	
	Поток = Новый ПотокВПамяти();
	ЗаписьДанных = Новый ЗаписьДанных(Поток);
	
	ЗаписьДанных.Записать(мДвоичныеДанные);
	
	ЗаписьДанных.Закрыть();
	
	Возврат Поток.ЗакрытьИПолучитьДвоичныеДанные();
	
КонецФункции

Процедура ЗаписьОшибкиПриРаботеСЯндексДиск(ТекстОшибки, ДополнениеКИмениСобытия = "") Экспорт 
	
	ЗаписьЖурналаРегистрации(СтрШаблон("Интеграция с Яндекс.Диск%1", ДополнениеКИмениСобытия), УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);	
	#Если Клиент Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	#КонецЕсли
	
КонецПроцедуры

Функция ПолучитьФайлПолномуПути(Путь) Экспорт 
	
	ПараметрыПользователя = ПолучитьПараметрыАвторизации();	
	
	Если ПараметрыПользователя = Неопределено Тогда
		Сообщить("Необходимо выполнить настройки авторизации Яндекс API.");
	КонецЕсли;
	
	СтруктураПараметров = РаботаСЯндексAPIВызовСервера.ПодготовкаСоединенияПоAPI(ПараметрыПользователя, "Сервер");
	Если СтруктураПараметров = Неопределено Тогда 
		Возврат Неопределено;;
	КонецЕсли;	
	
	СтруктураПараметров.Заголовки.Вставить("Content-Type", "application/json; charset=UTF-8");
	
	// Формируем запрос на получение URL для скачивания файла
	ЗапросHTTP = Новый HTTPЗапрос(СтрШаблон("%1?path=%2", 
		СтруктураПараметров.РесурсСкачиванияФайла,
		КодироватьСтроку(Путь, СпособКодированияСтроки.КодировкаURL, "UTF-8")), СтруктураПараметров.Заголовки
	);
	
	Ответ = СтруктураПараметров.Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	
	Если Не Ответ.КодСостояния = 200 Тогда
		ТекстОшибок = СтрШаблон("Ошибка HTTP запроса %1, код ошибки %2", Ответ.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
		РаботаСЯндексAPIВызовСервера.ЗаписьОшибкиПриРаботеСЯндексДиск(ТекстОшибок, ". Получить файл");
		Возврат Неопределено;
	КонецЕсли;
	
	HTTPСоединение	= Неопределено;
	ЗапросHTTP		= Неопределено;
	
	Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());

	Фабрика = ПрочитатьJSON(Чтение);
	
	Чтение.Закрыть();
	
	Если НЕ Фабрика.Свойство("href") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Теперь формируем запрос на скачивания файла
	Ответ = СформироватьЗапросПоПолученнойСсылке(Фабрика.href, СтруктураПараметров);
	
	// Если код 302 перевели на другую страницу для загрузки
	Если Ответ.КодСостояния = 302 И НЕ Ответ.Заголовки.Получить("Location") = Неопределено Тогда
		
		Ответ = СформироватьЗапросПоПолученнойСсылке(Ответ.Заголовки.Получить("Location"), СтруктураПараметров);
		
	КонецЕсли;
		
	Если Не Ответ.КодСостояния = 200 Тогда
		
		ТекстОшибки = СтрШаблон("Ошибка HTTP запроса %1, код ошибки %2", Ответ.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
		РаботаСЯндексAPIВызовСервера.ЗаписьОшибкиПриРаботеСЯндексДиск(ТекстОшибок, ". Получить файл");
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Попытка
		ДанныеФайла = Ответ.ПолучитьТелоКакДвоичныеДанные();
	Исключение
		ДанныеФайла = Неопределено;
	КонецПопытки;

	Возврат ДанныеФайла;
	
КонецФункции

Функция СформироватьЗапросПоПолученнойСсылке(URL, СтруктураПараметров) Экспорт
	
	СоставнойURL = новый Структура("href", URL);
	
	Если НЕ РазобратьURL("Загрузка архивного файла с Яндекс.Диск", СоставнойURL) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	SSL = ?(СоставнойURL.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено);
	Соединение = новый HTTPСоединение(СоставнойURL.Сервер, СоставнойURL.Порт,,,,, SSL);
	
	ЗапросHTTP = Новый HTTPЗапрос(СоставнойURL.АдресСкрипта, СтруктураПараметров.Заголовки); 
	
	Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьПапкиИзДиска(ПараметрыПользователя, КонечнаяПапка = "") Экспорт 
	
	СтруктураПараметров = ПодготовкаСоединенияПоAPI(ПараметрыПользователя, "Сервер");
	Если СтруктураПараметров = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	РазмерПорции = 1000;
	СтруктураПараметров.Заголовки.Вставить("Content-Type", "application/json");
	
	МассивПапок = Новый Массив;
	
	//#15582 есть параметр limit, который по умолчанию = 20
	// переделано на получение всех папок
	
	//СтрокаПодключения = СтрШаблон("%1?path=%2", 
	//							СтруктураПараметров.РесурсМетаданных,
	//							"disk:/" + КонечнаяПапка);
	//
	ЕстьПапки = Истина;
	ТекПозиция = 0;
	Пока ЕстьПапки Цикл
		СтрокаПодключения = СтрШаблон("%1?limit=%2&offset=%3&path=%4&sort=name", 
								СтруктураПараметров.РесурсМетаданных,
								Формат(РазмерПорции, "ЧГ="),
								Формат(ТекПозиция, "ЧН=0; ЧГ="),
								"disk:/" + КонечнаяПапка);
	
		ЗапросHTTP = Новый HTTPЗапрос(СтрокаПодключения, СтруктураПараметров.Заголовки);
	
		Ответ = СтруктураПараметров.Соединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	
		Если Ответ.КодСостояния = 404 Тогда
			ТекстОшибок = СтрШаблон("Не найдена папка для архивации в корне диска с наименованием: %1", КонечнаяПапка);
			ЗаписьОшибкиПриРаботеСЯндексДиск(ТекстОшибок, ". Получить папки");
			Возврат Неопределено;
		КонецЕсли;
	
		Если Не Ответ.КодСостояния = 200 Тогда
			ТекстОшибок = СтрШаблон("Ошибка HTTP запроса %1, код ошибки %2", Ответ.ПолучитьТелоКакСтроку(), Ответ.КодСостояния);
			ЗаписьОшибкиПриРаботеСЯндексДиск(ТекстОшибок, ". Получить папки");
			Возврат Неопределено;
		КонецЕсли;
	
		//HTTPСоединение	= Неопределено;
		//ЗапросHTTP		= Неопределено;
	
   		Чтение = Новый ЧтениеJSON();
		Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());

		Фабрика = ПрочитатьJSON(Чтение);
	
    	Чтение.Закрыть();
	
		Если НЕ Фабрика.Свойство("_embedded") Тогда
			Возврат Неопределено;
		КонецЕсли;
	
		Если Фабрика._embedded.Свойство("items") Тогда
			//МассивПапок = Фабрика._embedded.items;
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПапок, Фабрика._embedded.items, Ложь);
			
			ТекПозиция = ТекПозиция + РазмерПорции;
			Если Фабрика._embedded.items.Количество() < РазмерПорции Тогда
				ЕстьПапки = Ложь;	
			КонецЕсли;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивПапок;
	
КонецФункции


#Область Авторизация

Функция АвторизацияВыполнена() Экспорт
	
	СтруктураПараметров = ПолучитьПараметрыАвторизации();
	
	Если СтруктураПараметров = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ СтруктураПараметров.Свойство("ТокенОбновления") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ПустаяСтрока(СтруктураПараметров.ТокенОбновления) Или ПустаяСтрока(СтруктураПараметров.ТокенДоступа) Или СтруктураПараметров.ВремяЖизниТокенаAPI < ДобавитьМесяц(ТекущаяДатаСеанса(), -6) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция СохранитьПараметрыАвторизации(РезультатЗакрытия, ПараметрыПользователя) Экспорт
	
	// Сохраняем данные авторизации в регистр
	МенеджерЗаписи = РегистрыСведений.ТокеныСинхронизацииЯндексAPI.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторКлиента = ПараметрыПользователя.ИдентификаторКлиента;
	МенеджерЗаписи.СекретныйКодКлиента = ПараметрыПользователя.СекретныйКодКлиента;
	
	Попытка
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ИдентификаторКлиента = ПараметрыПользователя.ИдентификаторКлиента;
		МенеджерЗаписи.СекретныйКодКлиента = ПараметрыПользователя.СекретныйКодКлиента;
		МенеджерЗаписи.ТокенДоступа = РезультатЗакрытия.ТокенДоступа; 
		МенеджерЗаписи.ТокенОбновления = РезультатЗакрытия.ТокенОбновления;
		МенеджерЗаписи.ВремяЖизниТокенаAPI = РезультатЗакрытия.ВремяЖизниТокенаAPI;
		МенеджерЗаписи.Записать();
	Исключение
		Сообщить("Не удалось записать данные авторизации: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Процедура ЗаполнитьДействующиеТокены(ПараметрыПользователя)
	
	ПараметрыПользователя.Вставить("ТокенОбновления", "");
	ПараметрыПользователя.Вставить("ТокенДоступа", "");
	ПараметрыПользователя.Вставить("ВремяЖизниТокенаAPI", Дата(1,1,1));
	
	Если НЕ ПараметрыПользователя.Свойство("ИдентификаторКлиента") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТокеныСинхронизацииЯндексAPI.ТокенОбновления,
		|	ТокеныСинхронизацииЯндексAPI.ТокенДоступа,
		|	ТокеныСинхронизацииЯндексAPI.ВремяЖизниТокенаAPI
		|ИЗ
		|	РегистрСведений.ТокеныСинхронизацииЯндексAPI КАК ТокеныСинхронизацииЯндексAPI
		|ГДЕ
		|	ТокеныСинхронизацииЯндексAPI.ИдентификаторКлиента = &ИдентификаторКлиента
		|	И ТокеныСинхронизацииЯндексAPI.СекретныйКодКлиента = &СекретныйКодКлиента
		|";
	Запрос.УстановитьПараметр("ИдентификаторКлиента", ПараметрыПользователя.ИдентификаторКлиента);
	Запрос.УстановитьПараметр("СекретныйКодКлиента", ПараметрыПользователя.СекретныйКодКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыПользователя, Выборка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьТокены(ПараметрыПользователя, Знач ПараметрыСистемы) Экспорт
	
    СтрокаЗапроса = "grant_type=refresh_token" + "&";
    СтрокаЗапроса = СтрокаЗапроса + "client_id=" + ПараметрыПользователя.ИдентификаторКлиента + "&";
    СтрокаЗапроса = СтрокаЗапроса + "client_secret=" + ПараметрыПользователя.СекретныйКодКлиента + "&";
    СтрокаЗапроса = СтрокаЗапроса + "refresh_token=" + ПараметрыПользователя.ТокенОбновления;

	Соединение = Новый HTTPСоединение(ПараметрыСистемы.СерверАвторизации, 443,,,,, Новый ЗащищенноеСоединениеOpenSSL);

	Заголовки  = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ЗапросХТТП = Новый HTTPЗапрос(ПараметрыСистемы.РесурсАвторизации, Заголовки);
	ЗапросХТТП.УстановитьТелоИзСтроки(СтрокаЗапроса);

	Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросХТТП);
	
    Если Ответ.КодСостояния <> 200 Тогда Возврат КонецЕсли;

	Строка = Ответ.ПолучитьТелоКакСтроку();
	
    Чтение = Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(Строка);

	Фабрика = ФабрикаXDTO.ПрочитатьJSON(Чтение);
	
    Чтение.Закрыть();
	
    ПараметрыПользователя.ТокенДоступа = Фабрика.access_token;
	ПараметрыПользователя.ТокенОбновления = Фабрика.refresh_token;
	ПараметрыПользователя.ВремяЖизниТокенаAPI = ТекущаяДатаСеанса() + Число(Фабрика.expires_in) - 5; //так как есть небольшая задержка при проверки и создании/изменении учетки
	
	// Сохраняем новые данные авторизации в регистр
	МенеджерЗаписи = РегистрыСведений.ТокеныСинхронизацииЯндексAPI.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторКлиента = ПараметрыПользователя.ИдентификаторКлиента;
	МенеджерЗаписи.СекретныйКодКлиента = ПараметрыПользователя.СекретныйКодКлиента;
	
	Попытка
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ТокенДоступа = ПараметрыПользователя.ТокенДоступа; 
		МенеджерЗаписи.ТокенОбновления = ПараметрыПользователя.ТокенОбновления; 
		МенеджерЗаписи.ВремяЖизниТокенаAPI = ПараметрыПользователя.ВремяЖизниТокенаAPI;
		МенеджерЗаписи.Записать();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
